<?php

return [

    /*
    |--------------------------------------------------------------------------
    | درایورهای پرداخت (فارسی)
    |--------------------------------------------------------------------------
    | شما می‌توانید درایور را در فایل‌های پیکربندی تنظیم کنید،
    | اما این روش توصیه نمی‌شود زیرا بر اساس زبان برنامه تغییر نمی‌کند.
    | کلیدهای آرایه زیر به درایورهای پرداخت مربوط هستند.
    */

    'card_transfer' => [
        'title' => 'انتقال مستقیم بانکی',
        'description' => 'پرداخت آفلاین از طریق انتقال وجه کارت به کارت.',
    ],

    'credit' => [
        'title' => 'اعتباری',
        'description' => 'پرداخت آفلاین از طریق اعتبار حساب.',
    ],

    'zarinpal' => [
        'title' => 'زرین‌پال',
        'description' => 'پرداخت آنلاین و امن از طریق درگاه زرین‌پال.',
    ],

    'paykan' => [
        'title' => 'پیکان',
        'description' => 'پرداخت آنلاین و امن از طریق درگاه پیکان.',
    ],
];
