<?php

return [
    'zarinpal' => [
        -9 => 'خطای اعتبارسنجی.',
        -10 => 'ای‌پی یا مرچنت‌کد پذیرنده صحیح نیست.',
        -11 => 'مرچنت‌کد فعال نیست، لطفاً با پشتیبانی زرین‌پال تماس بگیرید.',
        -12 => 'تلاش بیش از حد مجاز؛ بعداً دوباره امتحان کنید.',
        -15 => 'درگاه پرداخت در حالت تعلیق است (لطفاً با پشتیبانی تماس بگیرید).',
        -16 => 'سطح کاربری پذیرنده معتبر نیست (لطفاً با پشتیبانی تماس بگیرید).',
        -17 => 'سطح کاربری پذیرنده معتبر نیست (لطفاً با پشتیبانی تماس بگیرید).',
        -18 => 'آدرس ارجاع (referrer) با دامنه ثبت‌شده مطابقت ندارد.',
        -19 => 'ایجاد تراکنش برای این ترمینال ممنوع است.',
        100 => 'عملیات موفق.',

        // PaymentRequest
        -30 => 'پذیرنده اجازه دسترسی به سرویس تسویه اشتراکی شناور را ندارد.',
        -31 => 'امکان تسویه فعال نیست؛ لطفاً حساب بانکی پیش‌فرض تسویه را در پنل اضافه کنید.',
        -32 => 'مبلغ تسهیم شناور از سقف مجاز بیشتر است.',
        -33 => 'تسهیم شناور معتبر نیست.',
        -34 => 'مبلغ تسهیم ثابت از سقف مجاز بیشتر است.',
        -35 => 'تعداد بخش‌های تسهیم شناور بیش از حد مجاز است.',
        -36 => 'حداقل مبلغ برای تسهیم شناور ۱۰٬۰۰۰ ریال است.',
        -37 => 'یک یا چند شبای واردشده برای تسهیم (از سمت بانک) غیرفعال است.',
        -38 => 'تسهیم نیاز به ثبت شِبا در شاپرک دارد.',
        -39 => 'خطای تسهیم رخ داده است!',
        -40 => 'پارامترهای extra نامعتبر است؛ مقدار expire_in صحیح نیست.',
        -41 => 'حداکثر مبلغ پرداختی ۱۰۰٬۰۰۰٬۰۰۰ تومان است.',

        // PaymentVerify
        -50 => 'نشست (Session) معتبر نیست؛ مبلغ پرداخت با مبلغ ارسالی یکسان نیست.',
        -51 => 'نشست معتبر نیست؛ نشست در وضعیت فعالِ پرداخت نیست.',
        -52 => 'خطای غیرمنتظره؛ لطفاً با پشتیبانی تماس بگیرید.',
        -53 => 'این پرداخت متعلق به همین merchant_id نیست.',
        -54 => 'Authority نامعتبر است.',
        -55 => 'درخواست پرداخت دستی (manual) یافت نشد.',
        101 => 'تراکنش وریفای شده است.',

        // PaymentReverse
        -60 => 'امکان ریورس کردن نشست با بانک وجود ندارد.',
        -61 => 'نشست در وضعیت موفق نیست.',
    ],
];
