<?php

return [

    /*
    |--------------------------------------------------------------------------
    | درایورهای پرداخت (فارسی)
    |--------------------------------------------------------------------------
    | شما می‌توانید درایور را در فایل‌های پیکربندی تنظیم کنید،
    | اما این روش توصیه نمی‌شود زیرا بر اساس زبان برنامه تغییر نمی‌کند.
    | کلیدهای آرایه زیر به درایورهای پرداخت مربوط هستند.
    */

    'card_transfer' => [
        'title' => 'کارت به کارت',
        'description' => 'پرداخت آفلاین از طریق انتقال وجه کارت به کارت.',
    ],

    'zarinpal' => [
        'title' => 'درگاه پرداخت زرین‌پال',
        'description' => 'پرداخت آنلاین و امن از طریق درگاه زرین‌پال.',
    ],

];
